app/views/user/home.html.erb

  	}
  	$.ajax({
	    url: "user_home",
	    method: "GET",
	    dataType: "json",
	    data: {product: product},
	    error: function (xhr, status, error) {
            console.log("error called")
	      	console.error('AJAX Error: ' + status + error);
	    },
	    success: function (response) {
	      	console.log(response);
            console.log("success function called")
	      	var item = response["item"];
	      	$("#item_id").empty();
            console.log("function called after item_id", item)
	      	$("#item_id").append('<option>Select Item</option>');
	      	for(var i = 0; i < item.length; i++){
                console.log(i, " ", item[i]["id"]);
	      		$("#item_id").append('<option value="' + item[i]["id"] + '">' +item[i]["item_name"] + '</option>');
	      	}
	    }
  	});
---
SELECT `items`.* FROM `items`

    <%= form.label :item_id %>
    <%= form.select(:item_id, Item.all.collect {|p| [p.item_name, p.id]},  {class: 'form-control'}) %>
---
SELECT `items`.`id` FROM `items`