app/views/items/_form.html.erb

    <%= form.label :product_id %>
    <% product_array = Product.all.map { |product| [product.product_name, product.id] } %>
---
SELECT `products`.* FROM `products`