app/controllers/admin_controller.rb

SELECT `orders`.* FROM `orders`
---
  def order_history
    @order=Order.all