app/controllers/cart_controller.rb

SELECT `items`.* FROM `items` WHERE `items`.`id` = 22 LIMIT 1
INSERT INTO `carts` (`user_email`, `product_id`, `item_id`, `quantity`, `created_at`, `updated_at`) VALUES ('mohit@gmail.com', '2', '17', 250, '2022-12-28 05:36:25.286592', '2022-12-28 05:36:25.286592')
---
  def save
    @cart=Cart.new(cart_params)
    search_item=Item.find(cart_params[:item_id])

    if search_item.quantity.to_i<cart_params[:quantity].to_i
      flash[:alert]="Please order less Quantity"
      redirect_to user_home_path
    else

      if @cart.save

SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 9 LIMIT 1
SELECT `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
SELECT `items`.* FROM `items` WHERE `items`.`id` = 19 LIMIT 1
---
  def show
    @cart=Cart.find(params[:cart_id])
    @product=Product.find(@cart[:product_id])
    @item=Item.find(@cart[:item_id])

SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 9 LIMIT 1
SELECT `items`.* FROM `items` WHERE `items`.`id` = 19 LIMIT 1
---
  def checkout

    @cart=Cart.find(params[:checkout_id])
    @item=Item.find(@cart[:item_id])

SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 15 LIMIT 1  [["id", 15], ["LIMIT", 1]]
---
        #UserNotifier.purchase_complete(session[:user],current_cart).deliver
        #flash[:notice]="Thank You for using Pink Flowers. The oreder details are sent to your mail"

        cart=Cart.find(params[:checkout_id])

SELECT `items`.* FROM `items` WHERE `items`.`id` = 22 LIMIT 1  [["id", 22], ["LIMIT", 1]]
UPDATE `items` SET `items`.`quantity` = 25, `items`.`updated_at` = '2022-12-27 05:10:58.285793' WHERE `items`.`id` = 22
INSERT INTO `orders` (`cart_id`, `user_email`, `product_id`, `item_id`, `quantity`, `created_at`, `updated_at`) VALUES (16, 'mohit@gmail.com', '3', '22', 5, '2022-12-27 05:10:58.313392', '2022-12-27 05:10:58.313392')
---
        order[:item_id]=cart.item_id
        order[:quantity]=cart.quantity

        search_item=Item.find(order[:item_id])
        diff= search_item.quantity-order[:quantity].to_i
        update_quantity=Hash.new
        update_quantity[:quantity]=diff
        search_item.update(update_quantity)
        order=Order.new(order)
        order.save