app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)
    search_item=Item.find_by_description(item_params[:description])


    respond_to do |format|
      if search_item != nil

       sum= search_item.quantity+item_params[:quantity].to_i
       updated_quantity=item_params.clone
       updated_quantity[:quantity]=sum
        search_item.update(updated_quantity)
        format.html { redirect_to items_path, notice: "Item already present so quanity updated" }


      elsif @item.save
---
SELECT `items`.* FROM `items` WHERE `items`.`description` = 'iPhone' LIMIT 1
UPDATE `items` SET `items`.`quantity` = 120, `items`.`price` = 30000, `items`.`updated_at` = '2022-12-26 07:39:32.690669' WHERE `items`.`id` = 20
INSERT INTO `items` (`item_name`, `description`, `quantity`, `price`, `product_id`, `created_at`, `updated_at`) VALUES ('Lenovo', 'ThinkPad', 10, 72000, 1, '2022-12-24 13:23:10.940619', '2022-12-24 13:23:10.940619')

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE `items` SET `items`.`quantity` = 15, `items`.`updated_at` = '2022-12-20 06:33:26.502120' WHERE `items`.`id` = 2

  def destroy
    @item.destroy
---
DELETE FROM `items` WHERE `items`.`id` = 18