app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`product_name`, `created_at`, `updated_at`) VALUES ('Printer', '2022-12-26 11:58:35.129087', '2022-12-26 11:58:35.129087')