app/controllers/user_controller.rb

INSERT INTO `users` (`name`, `email`, `password`, `created_at`, `updated_at`) VALUES ('', 'm@gmail.com', 123654789, '2022-12-21 08:07:18.130128', '2022-12-21 08:07:18.130128')
---
  def create
    @user=User.new(user_params)
    if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'mohit@gmail.com' LIMIT 1
---
  def login
    if request.post?
      search_user=User.find_by_email(user_params[:email])

SELECT `items`.`id` FROM `items`
SELECT `products`.* FROM `products`
SELECT `items`.* FROM `items` WHERE `items`.`id` = NULL LIMIT 1
SELECT `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
SELECT `items`.* FROM `items`
---
  def home
    @item=Item.all
    @session=session[:user]

    if params[:product].present?
      @item = Product.find(params[:product]).items

    else
      @item = Item.all